README.org
* duing.dev

This is my [[https://duing.dev][personal blog]]. It was heavily influenced by [[https://github.com/ratsclub][Victor Freire]], given that is totally based on Nix Flakes and Emacs. I'm very grateful to him for all
the help with the problems that I had along the way.

** Dependencies

- [[https://ox-hugo.scripter.co/][ox-hugo]]
- [[https://gitlab.com/gabmus/hugo-ficurinia/-/tree/master/][hugo-ficurinia]]

** Limitations

Local development is a pain. I can't see the preview of the website with the theme applied. The theme also removes local access to most of the
pages in the browser.
