README.md
# duing.dev

This is my [personal blog](https://duing.dev). It was heavily influenced by [Victor Freire](https://github.com/ratsclub), given that is totally based on Nix Flakes and Emacs. I'm very grateful to him for all
the help with the problems that I had along the way.

## Dependencies

- [ox-hugo](https://ox-hugo.scripter.co/)
- [hugo-ficurinia](https://gitlab.com/gabmus/hugo-ficurinia/-/tree/master/)

## Limitations

Local development is a pain. I can't see the preview of the website with the theme applied. The theme also removes local access to most of the
pages in the browser.
